Repository: HamdaniFatima/Innovation
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fr, it

source: The World Best Innovation
es: La mejor innovación del mundo
fr: La meilleure innovation au monde
it: La migliore innovazione del mondo

source: The World Best Innovation Stories
es: La mejor innovación del mundo
it: Le migliori storie di innovazione nel mondo

source: Plate-forme
es: Formato de plancha
it: Piattaforma

source: Innovation Stories is a free collaborative platform for easily creating,
es: Innovation Stories es una plataforma de colaboración gratuita para crear fácilmente,
fr: Innovation Stories est une plateforme collaborative gratuite permettant de créer facilement des histoires d'innovation.
it: Innovation Stories Ã¨ una piattaforma collaborativa gratuita per creare facilmente

source: and consulting innovation case studies.
es: y consultoría en innovación
fr: et la consultation d'études de cas sur l'innovation.
it: e consultando casi di studio sull'innovazione.

source: You are an Expert
es: Usted es un Experto
fr: Vous êtes un expert
it: Sei un esperto

source: Evaluate Innovation sotries based on your interests.
es: Evaluar los criterios de innovación en función de sus intereses.
fr: Évaluer les sotries d'innovation en fonction de vos intérêts.
it: Valutate le sotrie dell'innovazione in base ai vostri interessi.

source: Thank you for joining us.
es: Gracias por acompañarnos
it: Grazie per esserti unito a noi

source: You are a Student
es: Usted es un estudiante
fr: Merci de vous joindre à nous
it: Sei uno studente

source: If you are new to Innovation Stories, get started
es: Si es nuevo en Innovation Stories, comience
fr: Si vous êtes nouveau dans Innovation Stories, commencez dès maintenant.
it: Se siete nuovi a Innovation Stories, iniziate a lavorare con noi.

source: Get started
es: Comenzar
fr: Commencez à travailler
it: Iniziare

source: English
fr: anglais

source: French
fr: Francais
